[![class](https://img.youtube.com/vi/uU6OHj2vKAE/1.jpg)](https://www.youtube.com/watch?v=uU6OHj2vKAE&list=PLBHVuYlKEkUKnfbWvRCrwSuSeYh_QUlRl&index=23)
Video

In [1]:
import numpy as np
import pandas as pd

In [2]:
!conda install --y xlrd

Collecting package metadata (current_repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 4.7.10
  latest version: 4.7.12

Please update conda by running

    $ conda update -n base -c defaults conda



## Package Plan ##

  environment location: /home/lee/miniconda3/envs/tensorflow

  added / updated specs:
    - xlrd


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2019.10.16 |                0         131 KB
    xlrd-1.2.0                 |           py37_0         175 KB
    ------------------------------------------------------------
                                           Total:         306 KB

The following NEW packages will be INSTALLED:

  xlrd               pkgs/main/linux-64::xlrd-1.2.0-py37_0

The following packages will be UPDATED:

  ca-certificates                               2019.8.28-0 --> 2019.10.16-0



Downloading and Extracting Packages
ca-certificates-2019 | 131 KB    | ##################################### | 100%
xlrd-1.2.0           | 175 KB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [12]:
raw_data = {'account':[211829,320563,648336,109996,121213],
           'name':['a','b','c','d','e'],
           'street':[1,2,3,4,5],
           'city':['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns=['account','name','street','city'])
df

   account name  street           city
0   211829    a       1  San Francisco
1   320563    b       2      Baltimore
2   648336    c       3          Miami
3   109996    d       4        Douglas
4   121213    e       5         Boston

In [13]:
df['account'].head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [14]:
df[['account','street','city']]

   account  street           city
0   211829       1  San Francisco
1   320563       2      Baltimore
2   648336       3          Miami
3   109996       4        Douglas
4   121213       5         Boston

# Selection with index number

In [15]:
df[:3]

   account name  street           city
0   211829    a       1  San Francisco
1   320563    b       2      Baltimore
2   648336    c       3          Miami

In [16]:
df['account'][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [17]:
df['street'][:3]

0    1
1    2
2    3
Name: street, dtype: int64

# Series selection

In [18]:
account_series = df['account']
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [19]:
account_series[[0,1,2]]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [20]:
account_series[account_series<250000]

0    211829
3    109996
4    121213
Name: account, dtype: int64

In [21]:
account_series[[0,4,2]]

0    211829
4    121213
2    648336
Name: account, dtype: int64

In [22]:
account_series < 250000

0     True
1    False
2    False
3     True
4     True
Name: account, dtype: bool

In [23]:
df.index = df['account']
del df['account']
df.head()

        name  street           city
account
211829     a       1  San Francisco
320563     b       2      Baltimore
648336     c       3          Miami
109996     d       4        Douglas
121213     e       5         Boston

In [25]:
df[:3]

        name  street           city
account
211829     a       1  San Francisco
320563     b       2      Baltimore
648336     c       3          Miami

In [27]:
# df[[0,1,2]] makes error

In [28]:
df[['name','street']][:2]

        name  street
account
211829     a       1
320563     b       2

In [29]:
df.loc[[211829,320563],['name','city']]

        name           city
account
211829     a  San Francisco
320563     b      Baltimore

In [30]:
df.iloc[:2][:2]

        name  street           city
account
211829     a       1  San Francisco
320563     b       2      Baltimore

In [31]:
df[['name','street']].iloc[:3]

        name  street
account
211829     a       1
320563     b       2
648336     c       3

In [34]:
df.drop('city',axis=1)

        name  street
account
211829     a       1
320563     b       2
648336     c       3
109996     d       4
121213     e       5

In [37]:
matrix = df.as_matrix()
matrix[:3]

/home/lee/miniconda3/envs/tensorflow/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

array([['a', 1, 'San Francisco'],
       ['b', 2, 'Baltimore'],
       ['c', 3, 'Miami']], dtype=object)

In [38]:
matrix[:,-3:]

array([['a', 1, 'San Francisco'],
       ['b', 2, 'Baltimore'],
       ['c', 3, 'Miami'],
       ['d', 4, 'Douglas'],
       ['e', 5, 'Boston']], dtype=object)

In [40]:
matrix[:,-3:].sum(axis=0)

array(['abcde', 15, 'San FranciscoBaltimoreMiamiDouglasBoston'],
      dtype=object)